{
 "items": [
  {
   "selfLink": "https://www.googleapis.com/books/v1/volumes/vk7RtwEACAAJ",
   "volumeInfo": {
    "title": "Origin",
    "subtitle": "A Novel",
    "authors": [
     "Dan Brown"
    ],
    "publisher": "Doubleday Books",
    "publishedDate": "2017",
    "description": "Robert Langdon arrives at the Guggenheim Museum Bilbao to attend a major announcement - the unveiling of a discovery that \"will change the face of science forever.\" Edmond Kirsh, a billionaire and futurist whose inventions have made him a global figure, is about to reveal an astonishing breakthrough - one that will answer two of the fundamental questions of human existence. But the evening erupts into chaos, and Kirsch's precious discovery teeters on the brink of being lost forever. Langdon is forced into a desperate bid to flee to Barcelona on a perilour quest to locate the cryptic password that will unlock Kirsch's secret. Following a trail illuminated by modern art and enigmatic symbols, Langdon uncovers clues that ultimately bring him face-to-face with Kirsch's shocking discovery ... and the breathtaking truth that has long eluded us.",

    "pageCount": 461,
    "printType": "BOOK",
    "categories": [
     "Adventure stories"
    ],
    "averageRating": 3.5,
    "ratingsCount": 63,
    "maturityRating": "NOT_MATURE",

    "imageLinks": {
     "thumbnail": "http://books.google.com/books/content?id=vk7RtwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    "language": "en",
    "previewLink": "http://books.google.com/books?id=vk7RtwEACAAJ&dq=isbn:0385514239&hl=&cd=1&source=gbs_api",
    "infoLink": "http://books.google.com/books?id=vk7RtwEACAAJ&dq=isbn:0385514239&hl=&source=gbs_api",
    "canonicalVolumeLink": "https://books.google.com/books/about/Origin.html?hl=&id=vk7RtwEACAAJ"
   },
   "saleInfo": {
    "country": "US",
    "saleability": "NOT_FOR_SALE",
    "isEbook": false
   },
   "searchInfo": {
    "textSnippet": "Robert Langdon arrives at the Guggenheim Museum Bilbao to attend a major announcement - the unveiling of a discovery that &quot;will change the face of science forever."
   }
  }
 ]
}
